Repository: EFN/FLOC
Catalog: translate/*/index.mdh.po
Languages: no

source: title: Free Libre Open Collaboration theme: spacelab ... # What is this?
no: title: Free Libre Open Collaboration theme: spacelab

source: Free Libre Open Collaboration is a wordplay on Free Libre Open Source Software (FLOSS) it is a set of principles to obey by in order to better collaborate on projects across countries. These principles were developed to do campaigning, but they are generally useful for any project where you would like to develop once and make available in many locations, another word is Free Libre Open Campaigning.
no: Free Libre Open Collaboration (Frit Åpent Samarbeide) er et ordspill på Free Libre Open Source Software (FLOSS) det er en samling prinsipper du bør følge for å bedre samarbeide på prosjekter over landegrensene. Disse prinsippene er ikke begrenset til kampanjer, men kan brukes for et hvilket som helst prosjekt du ønsker å lage en gang og kjøre flere steder, et annet ord er Free Libre Open Campaigning (Fri Åpen Kampanje).

source: ## What we try to solve
no: ## Hva vi forsøker å løse

source: We are working on projects in a multinational setting. Often English is enough, but the majority of the population of the world doesn't speak English, and even when they all speak the same language there is a need adaptation to the local environent. Especially when a project is highly stylized and made in inaccessiable formats this is not necessarily easy, and almost the whole campaign has to be remade in each and every country.
no: Vi jobber på prosjekter i en multinasjonal setting. Ofte er engelsk nok, men majoriteten av verdens befolkning snakker ikke engelsk, og selv om alle snakker det samme språket kan det være behov for å tilpasse prosjektet til det lokale miljøet. Spesielt når prosjektet er sterkt tilsatt kan det ende opp med at nesten hele prosjektet må gjenskapes i hvert land.

source: ### Why would you spend extra time on doing it like this?
no: ### Hvorfor bør du bruke ekstra tid på dette?

source: Do yourselves what you like others to do to you. While this probably will cost you a lot more time the first time you do it, and a little more time the next times. The benefit comes from the fact that if others do this for just one project, you've probably saved everything and then some.
no: Gjør mot andre det du vil at andre skal gjøre mot deg. Selv om det sannsynligvis vil koste deg en god del ekstra tid den første gangen, og litt mer tid de neste gangene, så har du antakeligvis spart inn dette og litt til den første gangen du kan gjenbruke noe fra bare et annet prosjekt.

source: # The principles
no: # Prinsippene

source: ## Separate styling from information
no: ## Separer stylistiske data fra informasjon

source: This is one of the guiding principles in HTML, where CSS was separated. This allows a project to be reused for instance in another language.
no: Dette er en av de styrende prinsippene i HTML, da CSS ble separert ut. Dette tillater at prosjektet blir gjenbrukt for eksempel på andre språk.

source: ## Use a version control system
no: ## Bruk et versjonshåndteringssystem

source: There are several [version control systems](https://en.wikipedia.org/wiki/Version_control) available. Some of the best known are [GIT](https://git-scm.com/) and [Mercurial](https://www.mercurial-scm.org/), [for a list see here](https://en.wikipedia.org/wiki/List_of_version_control_software), but this is not necessary. Cloud storage most often also incorporates some kind of version control, while we prefer a proper source control management system, anything that let's you do changes and enables you to backtrack is usable.
no: Det finnes mange [versjonskontrollsystemer](https://no.wikipedia.org/wiki/Versjonskontrollsystem). Noen av de best kjente er [GIT](https://git-scm.com/) and [Mercurial](https://www.mercurial-scm.org/), [for en liste se her](https://en.wikipedia.org/wiki/List_of_version_control_software), men dette er ikke nødvendig. Skylagring inneholder som oftest noen former for versjonskontroll. Vi foretrekker et ordentlig versjonshåndteringsystem, men alt som tillater deg å gjøre endringer og spore dem er bruktbart når du gjør internasjonalisering.

source: ## Allow for translation
no: ## Tillat oversettelser

source: What this means is use easy to access formats like plain text, html, formatted text or other forms of text which easily can be used as input to a translation system (for example using [po4a](https://po4a.org/)).
no: Dette betyr å lage prosjektet i formater med enkel tilgang, slik som ren tekst, html, formatert tekst eller andre former for tekst som enkelt kan puttes inn i et oversettelsesystem (bruk for eksempel [po4a](https://po4a.org/)

source: ## Use good tools
no: ## Bruk gode verktøy

source: Good tools minimizes the workload, and the education cost on the involved project members. We are in the process of developing a list of good tools you can use to streamline this process.
no: Gode verktøy minimerer arbeidsbelastningen og opplæringskostnaden på de som er involvert i prosjektet. Vi jobber med å sette sammen en liste med gode verktøy du kan bruke for å strømlinjeforme denne prosessen.

source: ## License your project
no: ## Lisensier prosjektet ditt

source: Unfortunately in this world the default is that everything is copyrighted. If you want others to be able to use your work, indicate this by clearly setting a license. We recommend one of the permissive licenses from [Creative Commons](https://creativecommons.org/) which is available with translations in almost every language. But also if you don't want to be that permissive indicate that as well. A license stating simply contact us if you want to run this yourself is a good starting point.
no: Uheldigvis lever vi i en verden der alt per default er opphavsrettsbeskyttet. Hvis du vil at andre skal kunne bruke prosjektet ditt, indiker dette med å sette en lisens. Vi anbefaler en av de frie lisensene fra [Creative Commons](https://creativecommons.no/) som er tilgjengelig med oversettelser på så godt som alle språk. Hvis du ikke ønsker å være så åpen, indiker dette også. En lisens som ikke sier noe annet enn kontakt oss hvis du vil kjøre dette prosjektet selv er et godt utgangspunkt.
